/************************************************************************
* Copyright (C) 2020 Nercita
*
* 文件名称： ledtask.c
* 文件标识：
* 内容摘要： ledtask相关函数定义
* 其它说明：
* 当前版本：
* 作    者： woody
* 完成日期： 2020.09.07
*
* 修改记录1：
*    修改日期：
*    版 本 号：
*    修 改 人：
*    修改内容：
* 修改记录2：…
************************************************************************/
#include "ledtask.h"
#include "pwrtask.h"
#include "app.h"


OS_STK Runing_TASK_STK[Runing_State_STK_SIZE];

/**************************************************************************
* 函数名称: Runing_State
* 功能描述: 系统正常运行指示灯任务 一秒亮一次
* 输入参数: pvParameters 是在创建该任务时传递的形参
* 输出参数: 无
* 返 回 值: 无
* -----------------------------------------------
* 2020/09/07       V1.0      woody         创建
**************************************************************************/
void  Runing_Function(void *pvParameters)
{
    pvParameters = pvParameters;

    while (1) {
        Reversal_LED();         //LED翻转
        delay_ms(1000);         //延时5s
    }
}

/**************************************************************************
* 函数名称: LEDTaskSuspend
* 功能描述: 挂起运行指示灯任务
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
* -----------------------------------------------
* 2020/09/07       V1.0      woody         创建
**************************************************************************/
void LEDTaskSuspend(void)
{
    LED_Control(0);     //挂起LED任务的时候需要设置一下LED灯的状态
    OSTaskSuspend(Runing_State_PRIO);  //挂起运行指示灯任务
}

/**************************************************************************
* 函数名称: LEDTaskResume
* 功能描述: 挂起运行指示灯任务
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
* -----------------------------------------------
* 2020/09/07       V1.0      woody         创建
**************************************************************************/
void LEDTaskResume(void)
{
    LED_Control(0);     //恢复LED任务的时候需要设置一下LED灯的状态
    OSTaskResume(Runing_State_PRIO); //恢复运行指示灯任务
}

/**************************************************************************
* 函数名称: Creat_LED_Task
* 功能描述: 创建任务函数
* 输入参数: 无
* 输出参数: 无
* 返 回 值: 无
* -----------------------------------------------
* 2020/09/07       V1.0      woody         创建
**************************************************************************/
void Creat_LED_Task(void)
{
    OSTaskCreate(Runing_Function, (void *)0, (OS_STK *)&Runing_TASK_STK[Runing_State_STK_SIZE - 1], Runing_State_PRIO);
}
















